In [202]:
import pandas as pd
import numpy as np

try:
    df_excel = pd.read_excel('./planilhas/dataEx.xlsx', 
    )
except Exception as ex:
    print(ex.args)

df_excel

    Aluno  Nota P1  Nota P2   N1  Nota P3  Nota P4   N2  Resultado
0   Lucas      8.5      2.0  2.0      2.0      2.0  2.0        2.0
1   Lucas      8.5      2.0  2.0      2.0      2.0  2.0        2.0
2   Lucas      8.5      5.0  5.0      5.0      5.0  5.0        5.0
3  Felipe      9.8      8.8  8.8      8.8      8.8  8.8        8.8

In [203]:
print('Lenght Dataframe before: ', len(df_excel))

df_excel.drop_duplicates(keep=False,inplace=True)

df_excel

Lenght Dataframe before:  4

    Aluno  Nota P1  Nota P2   N1  Nota P3  Nota P4   N2  Resultado
2   Lucas      8.5      5.0  5.0      5.0      5.0  5.0        5.0
3  Felipe      9.8      8.8  8.8      8.8      8.8  8.8        8.8

In [204]:
df_excel = df_excel.reset_index()
df_excel.set_index('index',inplace=True)
df_excel

        Aluno  Nota P1  Nota P2   N1  Nota P3  Nota P4   N2  Resultado
index
2       Lucas      8.5      5.0  5.0      5.0      5.0  5.0        5.0
3      Felipe      9.8      8.8  8.8      8.8      8.8  8.8        8.8

In [205]:
import pandas as pd

df = pd.read_csv('./csvs/dataCS.csv', sep=';')
email_list = df['Email'].tolist()
print(df)
email_list

             Email      Nome  Notas
0  lucasrochaf2018     Lucas     85
1   Luisrochaf2020      Luis     31
2       Pedrof2022     Pedro     48
3        Eddief018     Eddie     11
4           fera89  Fernando     27

['lucasrochaf2018', 'Luisrochaf2020', 'Pedrof2022', 'Eddief018', 'fera89']

In [206]:
for index, row in df_excel.iterrows():
    Student = str(row['Aluno'])

In [207]:
df.set_index('Email', inplace=True)

In [209]:

import math
df_email_result = pd.DataFrame(columns=['Email', 'Notas'])
df_email_result.reset_index()

for index, row in df.iterrows():
    student = str(row['Nome'])
    email = row.name
    result = df_excel['Resultado'].where(student == df_excel['Aluno'])[2]
    if not math.isnan(result):
        df_email_result.append({'Email': email, 'Notas': result}, ignore_index=True)
        


   
    
df_email_result

/tmp/ipykernel_5763/3533786013.py:10: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_email_result.append({'Email': email, 'Notas': result}, ignore_index=True)

Empty DataFrame
Columns: [Email, Notas]
Index: []